rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
/*****************************************************************************
* Model: I2CBusMgr.qm
* File:  ./I2CBusMgr_gen.c
*
* This code has been generated by QM tool (see state-machine.com/qm).
* DO NOT EDIT THIS FILE MANUALLY. All your changes will be lost.
*
* This program is open source software: you can redistribute it and/or
* modify it under the terms of the GNU General Public License as published
* by the Free Software Foundation.
*
* This program is distributed in the hope that it will be useful, but
* WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY
* or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License
* for more details.
*****************************************************************************/
/*${.::I2CBusMgr_gen.c} ....................................................*/
/**
 * @file    I2CBusMgr.c
 * @brief   Declarations for functions for the I2CBusMgr AO.
 * This state machine handles all I/O on the I2C bus.  It can be instantiated
 * several times with a different bus for a parameter.  This AO doesn't handle
 * any actual I2C devices, just generic I2C bus operations such as sending the
 * start/end bit, waiting for events, initiating DMA reads/writes, etc.  I2C
 * devices should be handled in the I2CXDevMgr AOs.  This allows this AO to be
 * generic and reusable.
 *
 * @note 1: If editing this file, please make sure to update the I2CBusMgr.qm
 * model.  The generated code from that model should be very similar to the
 * code in this file.
 *
 * @date    10/24/2014
 * @author  Harry Rostovtsev
 * @email   harry_rostovtsev@datacard.com
 * Copyright (C) 2014 Datacard. All rights reserved.
 *
 * @addtogroup groupI2C
 * @{
 */

/* Includes ------------------------------------------------------------------*/
#include "I2CBusMgr.h"
#include "project_includes.h"           /* Includes common to entire project. */
#include "bsp.h"          /* For seconds to bsp tick conversion (SEC_TO_TICK) */
#include "I2C1DevMgr.h"
#include "stm32f4xx_dma.h"                           /* For DMA functionality */

/* Compile-time called macros ------------------------------------------------*/
Q_DEFINE_THIS_FILE                  /* For QSPY to know the name of this file */
DBG_DEFINE_THIS_MODULE( DC3_DBG_MODL_I2C ); /* For debug system to ID this module */

/* Private typedefs ----------------------------------------------------------*/

/**
 * @brief I2CMgr Active Object (AO) "class" that manages the I2C bus.
 * This AO manages the I2C bus and all events associated with it. It
 * has exclusive access to the I2C bus and the ISR handlers will let
 * the AO know that the transfer has completed.  See I2CMgr.qm for
 * diagram and model.
 */
/*${AOs::I2CBusMgr} ........................................................*/
typedef struct {
/* protected: */
    QActive super;

    /**< QPC timer Used to timeout I2C transfers if errors occur. */
    QTimeEvt i2cTimerEvt;

    /**< Which I2C bus this AO is responsible for.  This variable is set on
         startup and is used to index into the structure that holds all the
         I2C bus settings. */
    I2C_Bus_t iBus;

    /**< Counter used to manually timeout some I2C operations.  Though we supposed to
         not do blocking operations like this, it's unavoidable in this case since
         the I2C ISRs won't post events until they are cleared, which happens after
         here in the AO so nothing moves forward.  With all the delays introduced by
         just event handling, there should be no blocking in reality but just in case,
         there will still be timeout events launched from these loops if this counter
         gets to 0. */
    uint32_t nI2CLoopTimeout;

    /**< Specifies what the current I2C bus operation is happening.  Gets set upon
         reception of I2C_READ_START_SIG and I2C_WRITE_START_SIG */
    I2C_Operation_t i2cCurrOperation;

    /**< QPC timer Used to time I2C bus settling. */
    QTimeEvt i2cBusSettleTimerEvt;

    /**< Keep track of last error that occurs. */
    DC3Error_t errorCode;

    /**< QPC timer Used to timeout individual I2C bus accesses. */
    QTimeEvt i2cOpTimerEvt;

    /**< Keeps track of an address sent in with events in case the address needs to be
     * split up into multiple bytes */
    uint16_t addr;

    /**< pointer to opaque pointer to the I2CxDevMgr AO that this instance of I2CBusMgr
     * AO will directly post events to */
    QActive * p_AO_I2CDevMgr;
} I2CBusMgr;

/* protected: */
static QState I2CBusMgr_initial(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state is a catch-all Active state.
 * If any signals need to be handled that do not cause state transitions and
 * are common to the entire AO, they should be handled here.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_Active(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state indicates that the I2C bus is currently idle and the
 * incoming msg can be handled.
 * This state is the default rest state of the state machine and can handle
 * various I2C requests.  Upon entry, it also checks the deferred queue to see
 * if any request events are waiting which were posted while I2C bus was busy.
 * if there are any waiting, it will read them out, which automatically posts
 * them and the state machine will go and handle them.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_Idle(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief   This state indicates that the I2C is currently busy and cannot
 * process incoming data; incoming events will be deferred in this state and
 * handled once the AO goes back to Idle state.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_Busy(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for MASTER MODE (I2C EV5).
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV5(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_PollFor_I2C_EV5(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for selecting transmitter mode (I2C
 * EV6).
 * This state is a Timeout/Wait state for the polling child state for MASTER
 * TRANSMITTER MODE on the I2C bus.  It takes care of the timeout and sending a
 * result to anyone who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV6_TX(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_PollFor_I2C_EV6_TX(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for MASTER MODE (I2C EV5).
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV8(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for EV8 (MSB of the 2 byte address)
 *
 * This state posts an event to check for the
 * I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV8) which is triggerred by
 * sending the MSByte of the memory address of the device in the previous state.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If EV8 occurred, the state sends the LSByte of internal memory address of the
 * device from where we want to read/write.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV8_MSB(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for EV8 (LSB of the 2 byte address)
 *
 * This state posts an event to check for the
 * I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV8) which is triggerred by
 * sending the MSByte of the memory address of the device in the previous state.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If EV8 occurred, the state sends the LSByte of internal memory address of the
 * device from where we want to read/write.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV8_LSB(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state waits for I2C Bus recovery to complete or times out if stuck.
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_BusRecovery(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state initiates I2C bus recovery.
 * The bus can become stuck if slave device is misbehaving (or not correctly
 * implementing I2C protocol, or simply by being buggy). Most problems on the
 * I2C bus are caused by a timing issue of the STOP bit being sent and the slave
 * ends up locking the bus waiting for the STOP bit to arrive while the bus
 * master is unable to send it.  The only way to really resolve the issue is to
 * either reset the slave (not always possible) or to manually clock the bits in.
 *
 * This state does exactly that.  Upon entry, it changes the GPIO from I2C
 * configuration to regular GPIO and manually toggles the SCL line until the
 * SDA line is released by the slave.
 * On exit, this state reconfigures the GPIO back to I2C configuration.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitForBusRecovery(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state manually toggles SCL line for I2C bus recovery.
 * The bus can become stuck if slave device is misbehaving (or not correctly
 * implementing I2C protocol, or simply by being buggy). Most problems on the
 * I2C bus are caused by a timing issue of the STOP bit being sent and the slave
 * ends up locking the bus waiting for the STOP bit to arrive while the bus
 * master is unable to send it.  The only way to really resolve the issue is to
 * either reset the slave (not always possible) or to manually clock the bits in.
 *
 * This state manually toggles the SCL line until the SDA line is released
 * by the slave.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_TogglingSCL(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state waits for the bus to settle after being reconfigured to I2C.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitForBusToSettle(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state polls selects I2C master.
 * After a recovering the bus, the it needs to error out properly.  In order to
 * do this, a new communication has to be attempted.  This state initiates the
 * communication as if it is going to talk to a slave EEPROM.  An error is
 * expected and the I2C1_ER_IRQHandler ISR will clear it by calling the
 * I2C1_ErrorEventCallback function.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_PollFor_I2C_EV5_REC(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This state selects I2C transmitter mode.
 * After a recovering the bus, the it needs to error out properly.  In order to
 * do this, a new communication has to be attempted.  This state continues after
 * previous state, because sometimes the error can happen a little later.
 * An error is expected and the I2C1_ER_IRQHandler ISR will clear it by
 * calling the I2C1_ErrorEventCallback function.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_PollFor_I2C_EV6_REC(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for reading the internal memory of some device
 * on an I2C bus.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_MemRead(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for DMA I2C read.
 *
 * This state issues a DMA read command which does all the work and posts a timer
 * to make sure it happens in a timely manner.  The callback from the ISR for the
 * associated DMA stream will post the event with the read data, which will also
 * take the state machine out of this state and back to Idle.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitForDMAReadDone(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for reading I2C bytes manually.
 *
 * This state posts an event to check for the I2C_FLAG_RXNE flag has been set
 * which indicates that I2C data is ready to be read out.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If data is ready to read, the state machine reads the byte of data and stores
 * it in the buffer.  It then checks whether there is 1 byte left to read and if
 * so, issues a STOP bit on the bus.  This is due to a bug in the STM32 I2C IP
 * which requires that the STOP bit be sent before the last byte is read out.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_ReadI2CByte(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for selecting transmitter mode (I2C
 * EV6).
 * This state is a Timeout/Wait state for the polling child state for MASTER
 * TRANSMITTER MODE on the I2C bus.  It takes care of the timeout and sending a
 * result to anyone who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_EV6_RX(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_PollFor_I2C_EV6_RX(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for writing the internal memory of some device
 * on an I2C bus.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitFor_I2C_MemWrite(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for DMA I2C write.
 *
 * This state issues a DMA write command which does all the work and posts a timer
 * to make sure it happens in a timely manner.  The callback from the ISR for the
 * associated DMA stream will post the event signaling completion, which will also
 * take the state machine out of this state and back to Idle.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WaitForDMAWriteDone(I2CBusMgr * const me, QEvt const * const e);

/**
 * @brief This is a Wait state for polling for writing I2C bytes manually.
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_BYTE_TRANSMITTED
 * I2C event which indicates that I2C data is ready to be written out.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If data is ready to write, the state machine writes the byte of data and
 * loops back into the state to wait for next I2C event until no more bytes are
 * left to be written.  It then issues a STOP bit on the I2C bus and returns to
 * Idle.
 *
 * @note: this state is WRITE operation specific.
 * @note: some devices on I2C bus, such as EEPROMs, require a post write delay
 * during which the device will not respond to any data. This should be accounted
 * for by the user of this AO since this AO is not device specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
static QState I2CBusMgr_WriteI2CByte(I2CBusMgr * const me, QEvt const * const e);


/* Private defines -----------------------------------------------------------*/
/* Private macros ------------------------------------------------------------*/
/* Private variables and Local objects ---------------------------------------*/
static I2CBusMgr l_I2CBusMgr[MAX_I2C_BUS]; /* the single instance of the active object */

