rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
/* Global-scope objects ----------))------------------------------------------*/
QActive * const AO_I2CBusMgr[MAX_I2C_BUS] = {
    (QActive *)&l_I2CBusMgr[I2CBus1], /* "opaque" AO pointer to the I2CBusMgr for I2C1 */
};
extern I2C_BusSettings_t s_I2C_Bus[MAX_I2C_BUS];

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/**
 * @brief C "constructor" for I2CBusMgr "class".
 * Initializes all the timers and queues used by the AO, sets up a deferral
 * queue, and sets of the first state.
 * @param  [in] i2cBus: I2C_TypeDef * type that specifies which STM32 I2C bus this
 * AO is responsible for.
 * @retval None
 */
/*${AOs::I2CBusMgr_ctor} ...................................................*/
void I2CBusMgr_ctor(I2C_Bus_t iBus) {
    I2CBusMgr *me = &l_I2CBusMgr[iBus]; // Get the local pointer to the external instance
    me->iBus = iBus;  // Store which I2C bus this instance of the AO is handling

    QActive_ctor( &me->super, (QStateHandler)&I2CBusMgr_initial );
    QTimeEvt_ctor( &me->i2cTimerEvt, I2C_BUS_GLOBAL_TOUT_SIG );
    QTimeEvt_ctor( &me->i2cOpTimerEvt, I2C_BUS_OP_TOUT_SIG );
    QTimeEvt_ctor( &me->i2cBusSettleTimerEvt, I2C_BUS_SETTLE_TIMER_SIG );

    dbg_slow_printf("Constructor\n");
}

/**
 * @brief I2CMgr Active Object (AO) "class" that manages the I2C bus.
 * This AO manages the I2C bus and all events associated with it. It
 * has exclusive access to the I2C bus and the ISR handlers will let
 * the AO know that the transfer has completed.  See I2CMgr.qm for
 * diagram and model.
 */
/*${AOs::I2CBusMgr} ........................................................*/
/*${AOs::I2CBusMgr::SM} ....................................................*/
static QState I2CBusMgr_initial(I2CBusMgr * const me, QEvt const * const e) {
    /* ${AOs::I2CBusMgr::SM::initial} */
    (void)e;        /* suppress the compiler warning about unused parameter */

    me->errorCode = ERR_NONE; // Initialize error code to no error.

    QS_OBJ_DICTIONARY(&l_I2CBusMgr);
    QS_FUN_DICTIONARY(&QHsm_top);
    QS_FUN_DICTIONARY(&I2CBusMgr_initial);
    QS_FUN_DICTIONARY(&I2CBusMgr_Active);
    QS_FUN_DICTIONARY(&I2CBusMgr_Idle);
    return Q_TRAN(&I2CBusMgr_Idle);
}

/**
 * @brief This state is a catch-all Active state.
 * If any signals need to be handled that do not cause state transitions and
 * are common to the entire AO, they should be handled here.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active} ............................................*/
static QState I2CBusMgr_Active(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active} */
        case Q_ENTRY_SIG: {
            /* Post all the timers and disarm them right away so it can be
             * rearmed at any point without worrying asserts. */
            QTimeEvt_postIn(
                &me->i2cTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_GLOBAL )
            );
            QTimeEvt_disarm(&me->i2cTimerEvt);

            QTimeEvt_postIn(
                &me->i2cBusSettleTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_GLOBAL )
            );
            QTimeEvt_disarm(&me->i2cBusSettleTimerEvt);

            QTimeEvt_postIn(
                &me->i2cOpTimerEvt,
                (QActive *)me,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_GLOBAL )
            );
            QTimeEvt_disarm(&me->i2cOpTimerEvt);

            /* Get a pointer to the I2CxDevMgr AO to which this instance will directly
             * post events to. */
            if ( I2CBus1 == me->iBus ) {
                me->p_AO_I2CDevMgr = AO_I2C1DevMgr;
            //TODO: commented out since not implemented yet.  Uncomment if/when implemented
            //}
            //else if ( I2CBus2 == me->iBus ) {
            //    me->p_AO_I2CDevMgr = AO_I2C2DevMgr;
            //} else if ( I2CBus3 == me->iBus ) {
            //    me->p_AO_I2CDevMgr = AO_I2C3DevMgr;
            } else {
                ERR_printf(
                    "Unknown I2CBus%d specified for this instance of I2CBusMgr to post events to\n",
                    me->iBus+1
                );
            }

            I2C_BusInit( me->iBus ); /* Initialize the I2C devices and associated busses */
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&QHsm_top);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state indicates that the I2C bus is currently idle and the
 * incoming msg can be handled.
 * This state is the default rest state of the state machine and can handle
 * various I2C requests.  Upon entry, it also checks the deferred queue to see
 * if any request events are waiting which were posted while I2C bus was busy.
 * if there are any waiting, it will read them out, which automatically posts
 * them and the state machine will go and handle them.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Idle} ......................................*/
static QState I2CBusMgr_Idle(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Idle} */
        case Q_ENTRY_SIG: {
            DBG_printf("I2CBusMgr for I2CBus%d back in Idle\n", me->iBus+1);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_CHECK_FR~} */
        case I2C_BUS_CHECK_FREE_SIG: {
            /* Set error code assuming the operation will fail */
            me->errorCode = ERR_I2CBUS_BUSY;
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_CHECK_FR~::[BusFree?]} */
            if (RESET == I2C_GetFlagStatus( s_I2C_Bus[me->iBus].i2c_bus, I2C_FLAG_BUSY )) {
                me->errorCode = ERR_NONE;

                /* Allocate a dynamic event to send back the result after attempting to recover
                 * the I2C bus. */
                I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
                i2cStatEvt->i2cBus = me->iBus;         // set the bus
                i2cStatEvt->errorCode = me->errorCode; // set the error code that was last recorded.
                QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
                status_ = Q_HANDLED();
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_CHECK_FR~::[else]} */
            else {
                /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_CHECK_FR~::[else]::[ValidParams?]} */
                if (((I2CAddrEvt const *)e)->addrSize == 1 || ((I2CAddrEvt const *)e)->addrSize == 2) {
                    WRN_printf("I2CBus%d not free. Attempting recovery.\n", me->iBus+1);

                    me->addr = ((I2CAddrEvt const *)e)->addr; // Save the address
                    status_ = Q_TRAN(&I2CBusMgr_TogglingSCL);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_CHECK_FR~::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_INVALID_PARAMS_FOR_BUS_CHECK_FREE;

