rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
                    ERR_printf(
                        "Invalid params for I2CBus%d check, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );

                    /* Allocate a dynamic event to send back the result after attempting to recover
                     * the I2C bus. */
                    I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
                    i2cStatEvt->i2cBus = me->iBus;         // set the bus
                    i2cStatEvt->errorCode = me->errorCode; // set the error code that was last recorded.
                    QF_PUBLISH((QEvt *)i2cStatEvt, me);    // publish the event
                    status_ = Q_HANDLED();
                }
            }
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_START_BI~} */
        case I2C_BUS_START_BIT_SIG: {
            I2C_GenerateSTART(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);  /* Send START condition */
            status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV5);
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_7BI~} */
        case I2C_BUS_SEND_7BIT_ADDR_SIG: {
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_7BI~::[I2C_TX?]} */
            if (((I2CAddrEvt const *)e)->i2cDirection == I2C_Direction_Transmitter) {
                DBG_printf(
                    "Sending 7bitAddr 0x%02x with direction %d\n",
                    ((I2CAddrEvt const *)e)->addr & 0x00FF,
                    I2C_Direction_Receiver
                );

                /* Send slave Address for write */
                I2C_Send7bitAddress(
                    s_I2C_Bus[me->iBus].i2c_bus,            /* Get the STM32 designation of the I2C bus */
                    ((I2CAddrEvt const *)e)->addr & 0x00FF, /* Get the address from the event */
                    I2C_Direction_Transmitter               /* TX direction on the I2C bus */
                );
                status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_TX);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_7BI~::[I2C_RX?]} */
            else if (((I2CAddrEvt const *)e)->i2cDirection == I2C_Direction_Receiver) {
                DBG_printf(
                    "Sending 7bitAddr 0x%02x with direction %d\n",
                    ((I2CAddrEvt const *)e)->addr & 0x00FF,
                    I2C_Direction_Receiver
                );

                /* Send slave Address for write */
                I2C_Send7bitAddress(
                    s_I2C_Bus[me->iBus].i2c_bus,            /* Get the STM32 designation of the I2C bus */
                    ((I2CAddrEvt const *)e)->addr & 0x00FF, /* Get the address from the event */
                    I2C_Direction_Receiver                  /* RX direction on the I2C bus */
                );
                status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_RX);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_7BI~::[else]} */
            else {
                me->errorCode = ERR_I2CBUS_INVALID_PARAMS_FOR_7BIT_ADDR;

                ERR_printf(
                    "Invalid params for sending 7bit I2CBus%d Addr, error: 0x%08x\n",
                    me->iBus+1,
                    me->errorCode
                );

                /* Allocate a dynamic event to send back the result after attempting to recover
                 * the I2C bus. */
                I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
                i2cStatEvt->i2cBus = me->iBus;         // set the bus
                i2cStatEvt->errorCode = me->errorCode; // set the error code that was last recorded.
                QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
                status_ = Q_HANDLED();
            }
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_DEV~} */
        case I2C_BUS_SEND_DEV_ADDR_SIG: {
            /* Save the address */
            me->addr = ((I2CAddrEvt const *)e)->addr;
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_DEV~::[2byteAddr?]} */
            if (((I2CAddrEvt const *)e)->addrSize == 2) {
                DBG_printf(
                    "Sending internal MSB addr (0x%02x) to the I2C Device\n",
                    (uint8_t)((me->addr & 0xFF00) >> 8)
                );

                /* Send the MSB of the address first to the I2C device */
                I2C_SendData(
                    s_I2C_Bus[me->iBus].i2c_bus,
                    (uint8_t)((me->addr & 0xFF00) >> 8)
                );
                status_ = Q_TRAN(&I2CBusMgr_WaitFor_I2C_EV8_MSB);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_DEV~::[1byteAddr?]} */
            else if (((I2CAddrEvt const *)e)->addrSize == 1) {
                DBG_printf(
                    "Sending internal 1 byte addr (0x%02x) to the I2C Device\n",
                    (uint8_t)(me->addr & 0x00FF)
                );

                /* Send the LSB of the address to the I2C device */
                I2C_SendData(
                    s_I2C_Bus[me->iBus].i2c_bus,
                    (uint8_t)(me->addr & 0x00FF)
                );
                status_ = Q_TRAN(&I2CBusMgr_WaitFor_I2C_EV8_LSB);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_SEND_DEV~::[else]} */
            else {
                me->errorCode = ERR_I2CBUS_INVALID_PARAMS_FOR_SEND_DATA;

                ERR_printf(
                    "Invalid params for sending data on I2CBus%d Addr, error: 0x%08x\n",
                    me->iBus+1,
                    me->errorCode
                );

                /* Allocate a dynamic event to send back the result after attempting to recover
                 * the I2C bus. */
                I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
                i2cStatEvt->i2cBus = me->iBus;         // set the bus
                i2cStatEvt->errorCode = me->errorCode; // set the error code that was last recorded.
                QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
                status_ = Q_HANDLED();
            }
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_READ_MEM} */
        case I2C_BUS_READ_MEM_SIG: {
            /* Store device and operation settings from the event */
            s_I2C_Bus[me->iBus].nBytesExpected  = ((I2CReadMemReqEvt const *)e)->bytes;
            s_I2C_Bus[me->iBus].nBytesCurrent = 0;
            s_I2C_Bus[me->iBus].nRxIndex = 0;
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_READ_MEM::[DMAAccess?]} */
            if (((I2CReadMemReqEvt const *)e)->memAccessType == I2C_MEM_DMA) {
                DBG_printf("Starting DMA read on a device on I2CBus%d\n", me->iBus+1);


                status_ = Q_TRAN(&I2CBusMgr_WaitForDMAReadDone);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_READ_MEM::[ByteAccess?]} */
            else if (((I2CReadMemReqEvt const *)e)->memAccessType == I2C_MEM_BYTE) {
                DBG_printf("Starting Byte-by-byte read on a device on I2CBus%d\n", me->iBus+1);
                status_ = Q_TRAN(&I2CBusMgr_ReadI2CByte);
            }
            else {
                status_ = Q_UNHANDLED();
            }
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_WRITE_ME~} */
        case I2C_BUS_WRITE_MEM_SIG: {
            /* Store device and operation settings from the event */
            s_I2C_Bus[me->iBus].nBytesExpected  = ((I2CWriteMemReqEvt const *)e)->bytes;
            s_I2C_Bus[me->iBus].nBytesCurrent = 0;
            s_I2C_Bus[me->iBus].nTxIndex = 0;
            /* Copy the data right into the TX buffer for this I2C Bus. */
            MEMCPY(
                s_I2C_Bus[me->iBus].pTxBuffer,
                ((I2CWriteMemReqEvt const *)e)->dataBuf,
                s_I2C_Bus[me->iBus].nBytesExpected
            );
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_WRITE_ME~::[DMAAccess?]} */
            if (((I2CReadMemReqEvt const *)e)->memAccessType == I2C_MEM_DMA) {
                DBG_printf("Starting DMA write on a device on I2CBus%d\n", me->iBus+1);


