rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
                status_ = Q_TRAN(&I2CBusMgr_WaitForDMAWriteDone);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_WRITE_ME~::[ByteAccess?]} */
            else if (((I2CReadMemReqEvt const *)e)->memAccessType == I2C_MEM_BYTE) {
                DBG_printf("Starting Byte-by-byte read on a device on I2CBus%d\n", me->iBus+1);
                status_ = Q_TRAN(&I2CBusMgr_WriteI2CByte);
            }
            else {
                status_ = Q_UNHANDLED();
            }
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_ACK_EN} */
        case I2C_BUS_ACK_EN_SIG: {
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);
            DBG_printf("Enabling Ack on I2CBus%d\n", me->iBus+1);

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_ACK_DIS} */
        case I2C_BUS_ACK_DIS_SIG: {
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, DISABLE);
            DBG_printf("Disabling Ack on I2CBus%d\n", me->iBus+1);

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Idle::I2C_BUS_STOP_BIT} */
        case I2C_BUS_STOP_BIT_SIG: {
            I2C_GenerateSTOP(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);  /* Send STOP condition */

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief   This state indicates that the I2C is currently busy and cannot
 * process incoming data; incoming events will be deferred in this state and
 * handled once the AO goes back to Idle state.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy} ......................................*/
static QState I2CBusMgr_Busy(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy} */
        case Q_ENTRY_SIG: {
            /* Reset the maximum number of times to poll the I2C bus for an event */
            me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;

            /* Post a timer on entry */
            QTimeEvt_rearm(
                &me->i2cTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_GLOBAL )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm( &me->i2cTimerEvt ); /* Disarm timer on exit */

            QTimeEvt_disarm( &me->i2cOpTimerEvt ); /* Disarm timer on exit */
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::I2C_BUS_GLOBAL_T~} */
        case I2C_BUS_GLOBAL_TOUT_SIG: {
            ERR_printf(
                "Global timeout on I2CBus%d with error: 0x%08x\n",
                me->iBus+1,
                me->errorCode
            );
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::I2C_BUS_OP_TOUT} */
        case I2C_BUS_OP_TOUT_SIG: {
            ERR_printf(
                "Operation timeout on I2CBus%d with error: 0x%08x\n",
                me->iBus+1,
                me->errorCode
            );
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Active);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for MASTER MODE (I2C EV5).
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5} .....................*/
static QState I2CBusMgr_WaitFor_I2C_EV5(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5} */
        case Q_ENTRY_SIG: {
            /* Set error code that will be reported if things timeout or run out of retries */
            me->errorCode = ERR_I2CBUS_EV5_TIMEOUT;

