rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_BASIC_OP )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5} ....*/
static QState I2CBusMgr_PollFor_I2C_EV5(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV5 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV5 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5::I2C_CHECK_EV::[EV5?]} */
            if (I2C_CheckEvent(s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_MODE_SELECT)) {
                me->errorCode = ERR_NONE;
                status_ = Q_TRAN(&I2CBusMgr_Idle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV5);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV5::PollFor_I2C_EV5::I2C_CHECK_EV::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_EV5_NOT_REC;
                    ERR_printf(
                        "Didn't see I2C_EVENT_MASTER_MODE_SELECT (EV5) on I2CBus%d, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_EV5);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for selecting transmitter mode (I2C
 * EV6).
 * This state is a Timeout/Wait state for the polling child state for MASTER
 * TRANSMITTER MODE on the I2C bus.  It takes care of the timeout and sending a
 * result to anyone who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} ...................*/
static QState I2CBusMgr_WaitFor_I2C_EV6_TX(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} */
        case Q_ENTRY_SIG: {
            /* Set error code that will be reported if things timeout or run out of retries */
            me->errorCode = ERR_I2CBUS_EV6_TIMEOUT;

            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_BASIC_OP )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~} */
static QState I2CBusMgr_PollFor_I2C_EV6_TX(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV5 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV5 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[EV6(TX)?]} */
            if (I2C_CheckEvent( s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED )) {
                me->errorCode = ERR_NONE;
                status_ = Q_TRAN(&I2CBusMgr_Idle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_TX);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_EV6_NOT_REC;
                    ERR_printf(
                        "Didn't see I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED (EV6) on I2CBus%d, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_EV6_TX);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for MASTER MODE (I2C EV5).
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8} .....................*/
static QState I2CBusMgr_WaitFor_I2C_EV8(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8} */
        case Q_ENTRY_SIG: {
            /* Set error code that will be reported if things timeout or run out of retries */
            me->errorCode = ERR_I2CBUS_EV8_TIMEOUT;

