rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_BASIC_OP * 2 )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for EV8 (MSB of the 2 byte address)
 *
 * This state posts an event to check for the
 * I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV8) which is triggerred by
 * sending the MSByte of the memory address of the device in the previous state.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If EV8 occurred, the state sends the LSByte of internal memory address of the
 * device from where we want to read/write.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~} ..*/
static QState I2CBusMgr_WaitFor_I2C_EV8_MSB(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV8 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV6 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[EV8?]} */
            if (I2C_CheckEvent( s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_BYTE_TRANSMITTING )) {
                DBG_printf(
                    "Sending internal LSB addr (0x%02x) to the I2C Device\n",
                    (uint8_t)(me->addr & 0x00FF)
                );

                /* Send the LSB of the address to the I2C device */
                I2C_SendData(
                    s_I2C_Bus[me->iBus].i2c_bus,
                    (uint8_t)(me->addr & 0x00FF)
                );

                /* Reset the maximum number of times to poll the I2C bus for an event */
                me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;
                status_ = Q_TRAN(&I2CBusMgr_WaitFor_I2C_EV8_LSB);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_WaitFor_I2C_EV8_MSB);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_EV8_NOT_REC;
                    ERR_printf(
                        "Didn't see I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV5) for MSB on I2CBus%d, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_EV8);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for EV8 (LSB of the 2 byte address)
 *
 * This state posts an event to check for the
 * I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV8) which is triggerred by
 * sending the MSByte of the memory address of the device in the previous state.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If EV8 occurred, the state sends the LSByte of internal memory address of the
 * device from where we want to read/write.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~} ..*/
static QState I2CBusMgr_WaitFor_I2C_EV8_LSB(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV8 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV6 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[EV8?]} */
            if (I2C_CheckEvent( s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_BYTE_TRANSMITTING )) {
                me->errorCode = ERR_NONE;
                status_ = Q_TRAN(&I2CBusMgr_Idle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_WaitFor_I2C_EV8_LSB);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV8::WaitFor_I2C_EV8_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_EV8_NOT_REC;
                    ERR_printf(
                        "Didn't see I2C_EVENT_MASTER_BYTE_TRANSMITTING (EV5) for LSB on I2CBus%d, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_EV8);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state waits for I2C Bus recovery to complete or times out if stuck.
 *
 * This state is a Timeout/Wait state for the polling child state for MASTER MODE
 * on the I2C bus.  It takes care of the timeout and sending a result to anyone
 * who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery} .........................*/
static QState I2CBusMgr_BusRecovery(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery} */
        case Q_ENTRY_SIG: {
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_BUS_RECOVERY )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to send back the result after attempting to recover
             * the I2C bus. */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus = me->iBus;        // set the bus

            /* Check if the bus is free */
            if ( RESET == I2C_GetFlagStatus( s_I2C_Bus[me->iBus].i2c_bus, I2C_FLAG_BUSY ) ) {
                me->errorCode = ERR_NONE;
                DBG_printf("I2CBus%d free after recovery and ready to go.\n", me->iBus+1);
            } else {
                ERR_printf("Attempt to recover I2CBus%d failed with error: 0x%08x\n", me->iBus+1, me->errorCode);
            }
            i2cStatEvt->errorCode = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state initiates I2C bus recovery.
 * The bus can become stuck if slave device is misbehaving (or not correctly
 * implementing I2C protocol, or simply by being buggy). Most problems on the
 * I2C bus are caused by a timing issue of the STOP bit being sent and the slave
 * ends up locking the bus waiting for the STOP bit to arrive while the bus
 * master is unable to send it.  The only way to really resolve the issue is to
 * either reset the slave (not always possible) or to manually clock the bits in.
 *
 * This state does exactly that.  Upon entry, it changes the GPIO from I2C
 * configuration to regular GPIO and manually toggles the SCL line until the
 * SDA line is released by the slave.
 * On exit, this state reconfigures the GPIO back to I2C configuration.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~} ......*/
static QState I2CBusMgr_WaitForBusRecovery(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~} */
        case Q_ENTRY_SIG: {
            /* Set the pins up for manual toggling */
            I2C_BusInitForRecovery( me->iBus );

