rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            me->errorCode = ERR_I2CBUS_RCVRY_SDA_STUCK_LOW;

            /* Reset the maximum number of times to poll the I2C bus for an event */
            me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;

            WRN_printf("Some I2C%d slave device is misbehaving.\n", (me->iBus) + 1);
            WRN_printf("Attempting to recover bus by toggling the SCL line\n");
            WRN_printf("This may cause data corruption if the last I2C op was a write\n");
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~} */
        case Q_EXIT_SIG: {
            /* Initialize the I2C devices and associated busses */
            LOG_printf("ReInitializing I2C%d bus.\n", (me->iBus) + 1);
            I2C_BusInit( me->iBus );
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_BusRecovery);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state manually toggles SCL line for I2C bus recovery.
 * The bus can become stuck if slave device is misbehaving (or not correctly
 * implementing I2C protocol, or simply by being buggy). Most problems on the
 * I2C bus are caused by a timing issue of the STOP bit being sent and the slave
 * ends up locking the bus waiting for the STOP bit to arrive while the bus
 * master is unable to send it.  The only way to really resolve the issue is to
 * either reset the slave (not always possible) or to manually clock the bits in.
 *
 * This state manually toggles the SCL line until the SDA line is released
 * by the slave.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL} */
static QState I2CBusMgr_TogglingSCL(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL} */
        case Q_ENTRY_SIG: {
            /* Toggle the SCL bit of the bus to the opposite value that it is now */
            GPIO_ToggleBits( s_I2C_Bus[me->iBus].scl_port, s_I2C_Bus[me->iBus].scl_pin );

            /* Directly post a static event to this AO so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if bus is busy.  If free, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL::I2C_CHECK_EV::[BusFree?]} */
            if (SET == GPIO_ReadInputDataBit( s_I2C_Bus[me->iBus].sda_port, s_I2C_Bus[me->iBus].sda_pin  )) {
                WRN_printf(
                    "I2CBus%d free after %d SCL toggles\n",
                    me->iBus+1,
                    MAX_I2C_TIMEOUT - me->nI2CLoopTimeout
                );

                /* Make sure to leave the SCL line high after exit */
                GPIO_SetBits( s_I2C_Bus[me->iBus].scl_port, s_I2C_Bus[me->iBus].scl_pin );

                /* Reset the maximum number of times to poll the I2C bus for an event */
                me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;
                status_ = Q_TRAN(&I2CBusMgr_WaitForBusToSettle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_TogglingSCL);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusRecove~::TogglingSCL::I2C_CHECK_EV::[else]::[else]} */
                else {
                    ERR_printf("Timeout waiting for I2CBus%d bus to be free\n", me->iBus+1);
                    I2C_SoftwareResetCmd(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);
                    I2C_SoftwareResetCmd(s_I2C_Bus[me->iBus].i2c_bus, DISABLE);
                    DBG_printf("I2C bus reset\n");
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitForBusRecovery);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state waits for the bus to settle after being reconfigured to I2C.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusToSett~} ......*/
static QState I2CBusMgr_WaitForBusToSettle(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusToSett~} */
        case Q_ENTRY_SIG: {
            /* Post a timer on entry */
            QTimeEvt_rearm(
                &me->i2cBusSettleTimerEvt,
                SEC_TO_TICKS( LL_MAX_TIME_SEC_I2C_BUS_SETTLE )
            );

            /* Rearm the main I2C timer for a value that is enough for the current recovery
             * effort and enough to retry the operation that caused the problem in the first
             * place */
            QTimeEvt_rearm(
                &me->i2cTimerEvt,
                SEC_TO_TICKS( LL_MAX_TIME_SEC_I2C_BUS_SETTLE + LL_MAX_TOUT_SEC_I2C_BUS_RECOVERY )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusToSett~} */
        case Q_EXIT_SIG: {
            QTimeEvt_disarm( &me->i2cBusSettleTimerEvt );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::WaitForBusToSett~::I2C_BUS_SETTLE_T~} */
        case I2C_BUS_SETTLE_TIMER_SIG: {
            WRN_printf(
                "Finished waiting for I2CBus%d to settle after reset and intentional failure\n",
                me->iBus+1
            );

            me->errorCode = ERR_I2CBUS_RCVRY_EV5_NOT_REC;

