rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            /* Send START condition */
            WRN_printf("Generating I2C start after bus reset on I2CBus%d\n", me->iBus+1);
            I2C_GenerateSTART(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);
            status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV5_REC);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_BusRecovery);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state polls selects I2C master.
 * After a recovering the bus, the it needs to error out properly.  In order to
 * do this, a new communication has to be attempted.  This state initiates the
 * communication as if it is going to talk to a slave EEPROM.  An error is
 * expected and the I2C1_ER_IRQHandler ISR will clear it by calling the
 * I2C1_ErrorEventCallback function.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~} ......*/
static QState I2CBusMgr_PollFor_I2C_EV5_REC(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~} */
        case Q_ENTRY_SIG: {
            /* Directly post a static event to this AO so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV5 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~::I2C_CHECK_EV::[EV5?]} */
            if (I2C_CheckEvent(s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_MODE_SELECT)) {
                WRN_printf("Selecting slave device on I2CBus%d\n", me->iBus+1);

                me->errorCode = ERR_I2CBUS_RCVRY_EV6_NOT_REC;

                /* Set the direction to transmit the address */
                I2C_SetDirection( me->iBus,  I2C_Direction_Transmitter);

                /* Send slave Address for write */
                I2C_Send7bitAddress(
                    s_I2C_Bus[me->iBus].i2c_bus,            // This is always the bus used in this ISR
                    me->addr,                               // Look up the saved device address on this bus
                    s_I2C_Bus[me->iBus].bTransDirection     // Direction of data on this bus
                );

                /* Reset the maximum number of times to poll the I2C bus for an event */
                me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;
                status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_REC);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV5_REC);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV5_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    WRN_printf("Expected timeout waiting for EV5 after I2CBus%d recovery\n", me->iBus+1);
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_BusRecovery);
            break;
        }
    }
    return status_;
}

/**
 * @brief This state selects I2C transmitter mode.
 * After a recovering the bus, the it needs to error out properly.  In order to
 * do this, a new communication has to be attempted.  This state continues after
 * previous state, because sometimes the error can happen a little later.
 * An error is expected and the I2C1_ER_IRQHandler ISR will clear it by
 * calling the I2C1_ErrorEventCallback function.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~} ......*/
static QState I2CBusMgr_PollFor_I2C_EV6_REC(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~} */
        case Q_ENTRY_SIG: {
            /* Directly post a static event to this AO so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV6 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~::I2C_CHECK_EV::[EV6(RX)?]} */
            if (I2C_CheckEvent( s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED )) {
                WRN_printf("Got expected EV6 after I2CBus%d recovery\n", me->iBus+1);
                status_ = Q_TRAN(&I2CBusMgr_Idle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_REC);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::BusRecovery::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    WRN_printf("Expected timeout waiting for EV6 after I2CBus%d recovery\n", me->iBus+1);
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_BusRecovery);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for reading the internal memory of some device
 * on an I2C bus.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~} ...................*/
static QState I2CBusMgr_WaitFor_I2C_MemRead(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~} */
        case Q_ENTRY_SIG: {
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_MEM_READ )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to send back the result after attempting to recover
             * the I2C bus. */
            I2CBusDataEvt *i2cBusDataEvt = Q_NEW( I2CBusDataEvt, I2C_BUS_DONE_SIG );
            i2cBusDataEvt->i2cBus = me->iBus;
            i2cBusDataEvt->errorCode = me->errorCode;
            i2cBusDataEvt->dataLen = s_I2C_Bus[I2CBus1].nBytesExpected;
            MEMCPY(
                i2cBusDataEvt->dataBuf,
                s_I2C_Bus[I2CBus1].pRxBuffer,
                i2cBusDataEvt->dataLen
            );
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cBusDataEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for DMA I2C read.
 *
 * This state issues a DMA read command which does all the work and posts a timer
 * to make sure it happens in a timely manner.  The callback from the ISR for the
 * associated DMA stream will post the event with the read data, which will also
 * take the state machine out of this state and back to Idle.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::WaitForDMAReadDo~} */
static QState I2CBusMgr_WaitForDMAReadDone(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::WaitForDMAReadDo~} */
        case Q_ENTRY_SIG: {
            /* Reset the number of bytes already read to 0 */
            s_I2C_Bus[me->iBus].nBytesCurrent = 0;

            /* Start the DMA read operation */
            I2C_StartDMARead(
                me->iBus,
                s_I2C_Bus[me->iBus].nBytesExpected
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::WaitForDMAReadDo~::I2C_BUS_OP_TOUT} */
        case I2C_BUS_OP_TOUT_SIG: {
            ERR_printf("DMA READ Operation timeout on I2CBus%d.  Error: 0x%08x\n", me->iBus+1, me->errorCode);

            /* These operations are bus specific */
            if ( I2CBus1 == me->iBus ) {
                ERR_printf("DMA1_St0 fifo is at %d\n", DMA_GetFIFOStatus(DMA1_Stream0) );
                ERR_printf("DMA1_St0 TC flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_IT_TCIF0) );
                ERR_printf("DMA1_St0 FE flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_FEIF0) );
                ERR_printf("DMA1_St0 DM flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_DMEIF0) );
                ERR_printf("DMA1_St0 TE flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_TEIF0) );
                ERR_printf("DMA1_St0 HT flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_HTIF0) );


                if (DMA_GetCmdStatus(DMA1_Stream0)== ENABLE) {
                    ERR_printf("DMA1_Stream0 still enabled, turning off\n");
                    DMA_Cmd( DMA1_Stream0, DISABLE );
                }
            }

            /* Disable Acknowledgment */
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, DISABLE);

            I2C_GenerateSTOP(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);

            /* Re-Enable Acknowledgment to be ready for another reception */
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);

