rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            DBG_printf("Generating I2C stop\n");
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::WaitForDMAReadDo~::I2C_BUS_DMA_DONE} */
        case I2C_BUS_DMA_DONE_SIG: {
            DBG_printf("Got I2C_BUS_DMA_DONE on I2CBus%d\n", me->iBus+1);
            me->errorCode = ERR_NONE; // Everything went fine if this signal is received
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_MemRead);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for reading I2C bytes manually.
 *
 * This state posts an event to check for the I2C_FLAG_RXNE flag has been set
 * which indicates that I2C data is ready to be read out.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If data is ready to read, the state machine reads the byte of data and stores
 * it in the buffer.  It then checks whether there is 1 byte left to read and if
 * so, issues a STOP bit on the bus.  This is due to a bug in the STM32 I2C IP
 * which requires that the STOP bit be sent before the last byte is read out.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte} ......*/
static QState I2CBusMgr_ReadI2CByte(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV8 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV6 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[ReadyToRead?]} */
            if (RESET != I2C_GetFlagStatus( s_I2C_Bus[me->iBus].i2c_bus, I2C_FLAG_RXNE )) {
                /* Reset the maximum number of times to poll the I2C bus for an event */
                me->nI2CLoopTimeout = MAX_I2C_TIMEOUT;

                s_I2C_Bus[me->iBus].pRxBuffer[s_I2C_Bus[me->iBus].nBytesCurrent++] =
                    I2C_ReceiveData(s_I2C_Bus[me->iBus].i2c_bus);
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[ReadyToRead?]::[>1byteleft?]} */
                if ((s_I2C_Bus[me->iBus].nBytesExpected - s_I2C_Bus[me->iBus].nBytesCurrent) > 1) {
                    status_ = Q_TRAN(&I2CBusMgr_ReadI2CByte);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[ReadyToRead?]::[1byteleft?]} */
                else if (1 == (s_I2C_Bus[me->iBus].nBytesExpected - s_I2C_Bus[me->iBus].nBytesCurrent)) {
                    DBG_printf("Done Reading\n");
                    I2C_AcknowledgeConfig( s_I2C_Bus[me->iBus].i2c_bus, DISABLE); /* Disable Acknowledgment */
                    I2C_GenerateSTOP(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);        /* Generate Stop */
                    status_ = Q_TRAN(&I2CBusMgr_ReadI2CByte);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[ReadyToRead?]::[else]} */
                else {
                    I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, ENABLE); /* Re-enable Acknowledgment */
                    DBG_printf("Done reading I2C data\n");
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_ReadI2CByte);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemR~::ReadI2CByte::I2C_CHECK_EV::[else]::[else]} */
                else {
                    ERR_printf("Timeout waiting for I2C_FLAG_RXNE on I2CBus%d\n", me->iBus+1);
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_MemRead);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for selecting transmitter mode (I2C
 * EV6).
 * This state is a Timeout/Wait state for the polling child state for MASTER
 * TRANSMITTER MODE on the I2C bus.  It takes care of the timeout and sending a
 * result to anyone who is listening for this event.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} ...................*/
static QState I2CBusMgr_WaitFor_I2C_EV6_RX(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} */
        case Q_ENTRY_SIG: {
            /* Set error code that will be reported if things timeout or run out of retries */
            me->errorCode = ERR_I2CBUS_EV6_TIMEOUT;

