rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_BASIC_OP )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to directly post to the proper I2CxDevMgr AO */
            I2CStatusEvt* i2cStatEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatEvt->i2cBus       = me->iBus;      // set the bus
            i2cStatEvt->errorCode    = me->errorCode; // set the error code that was last recorded.
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatEvt, me); // directly post the event to the correct AO
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Poll state for polling for MASTER MODE (I2C EV5).
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_MODE_SELECT (EV5)
 * which is triggerred by posting a START bit on the I2C bus. It also checks if
 * the system is out of retries for this action and exits if true.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~} */
static QState I2CBusMgr_PollFor_I2C_EV6_RX(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~} */
        case Q_ENTRY_SIG: {
            /* Directly post an event to this AO to check for EV5 event. Post directly
             * instead of publishing so we don't waste memory */
            static QEvt const qEvt = { I2C_CHECK_EV_SIG, 0U, 0U };
            QACTIVE_POST(AO_I2CBusMgr[me->iBus], &qEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV5 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[EV6(RX)?]} */
            if (I2C_CheckEvent( s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED )) {
                me->errorCode = ERR_NONE;
                status_ = Q_TRAN(&I2CBusMgr_Idle);
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_PollFor_I2C_EV6_RX);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_EV6_~::PollFor_I2C_EV6_~::I2C_CHECK_EV::[else]::[else]} */
                else {
                    me->errorCode = ERR_I2CBUS_EV6_NOT_REC;
                    ERR_printf(
                        "Didn't see I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED (EV6) on I2CBus%d, error: 0x%08x\n",
                        me->iBus+1,
                        me->errorCode
                    );
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_EV6_RX);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for writing the internal memory of some device
 * on an I2C bus.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~} ...................*/
static QState I2CBusMgr_WaitFor_I2C_MemWrite(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~} */
        case Q_ENTRY_SIG: {
            /* Post an operation timer on entry */
            QTimeEvt_rearm(
                &me->i2cOpTimerEvt,
                SEC_TO_TICKS( LL_MAX_TOUT_SEC_I2C_MEM_WRITE )
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~} */
        case Q_EXIT_SIG: {
            /* Timer disarmed in parent state */

            /* Allocate a dynamic event to send back the result after attempting to recover
             * the I2C bus. */
            I2CStatusEvt *i2cStatusEvt = Q_NEW( I2CStatusEvt, I2C_BUS_DONE_SIG );
            i2cStatusEvt->i2cBus = me->iBus;
            i2cStatusEvt->errorCode = me->errorCode;
            QACTIVE_POST(me->p_AO_I2CDevMgr, (QEvt *)i2cStatusEvt, me);
            status_ = Q_HANDLED();
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_Busy);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for DMA I2C write.
 *
 * This state issues a DMA write command which does all the work and posts a timer
 * to make sure it happens in a timely manner.  The callback from the ISR for the
 * associated DMA stream will post the event signaling completion, which will also
 * take the state machine out of this state and back to Idle.
 *
 * @note: this state is READ operation specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WaitForDMAWriteD~} */
static QState I2CBusMgr_WaitForDMAWriteDone(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WaitForDMAWriteD~} */
        case Q_ENTRY_SIG: {
            /* Reset the number of bytes already read to 0 */
            s_I2C_Bus[me->iBus].nBytesCurrent = 0;

            DBG_printf(
                "Issuing a DMA write on I2CBus%d with %d bytes\n",
                me->iBus+1,
                s_I2C_Bus[me->iBus].nBytesExpected
            );

            /* Start the DMA read operation */
            I2C_StartDMAWrite(
                me->iBus,
                s_I2C_Bus[me->iBus].nBytesExpected
            );
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WaitForDMAWriteD~::I2C_BUS_OP_TOUT} */
        case I2C_BUS_OP_TOUT_SIG: {
            ERR_printf("DMA READ Operation timeout on I2CBus%d.  Error: 0x%08x\n", me->iBus+1, me->errorCode);

            /* These operations are bus specific */
            if ( I2CBus1 == me->iBus ) {
                ERR_printf("DMA1_St0 fifo is at %d\n", DMA_GetFIFOStatus(DMA1_Stream0) );
                ERR_printf("DMA1_St0 TC flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_IT_TCIF0) );
                ERR_printf("DMA1_St0 FE flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_FEIF0) );
                ERR_printf("DMA1_St0 DM flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_DMEIF0) );
                ERR_printf("DMA1_St0 TE flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_TEIF0) );
                ERR_printf("DMA1_St0 HT flag: %d\n", DMA_GetFlagStatus(DMA1_Stream0,DMA_FLAG_HTIF0) );


                if (DMA_GetCmdStatus(DMA1_Stream0)== ENABLE) {
                    ERR_printf("DMA1_Stream0 still enabled, turning off\n");
                    DMA_Cmd( DMA1_Stream0, DISABLE );
                }
            }

            /* Disable Acknowledgment */
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, DISABLE);

            I2C_GenerateSTOP(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);

            /* Re-Enable Acknowledgment to be ready for another reception */
            I2C_AcknowledgeConfig(s_I2C_Bus[me->iBus].i2c_bus, ENABLE);

