rost0031/STM32491_CPLR/Firmware/Common/bsp/i2c/I2CBusMgr.c
            DBG_printf("Generating I2C stop\n");
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WaitForDMAWriteD~::I2C_BUS_DMA_DONE} */
        case I2C_BUS_DMA_DONE_SIG: {
            DBG_printf("Got I2C_BUS_DMA_DONE on I2CBus%d\n", me->iBus+1);
            me->errorCode = ERR_NONE; // Everything went fine if this signal is received
            status_ = Q_TRAN(&I2CBusMgr_Idle);
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_MemWrite);
            break;
        }
    }
    return status_;
}

/**
 * @brief This is a Wait state for polling for writing I2C bytes manually.
 *
 * This state posts an event to check for the I2C_EVENT_MASTER_BYTE_TRANSMITTED
 * I2C event which indicates that I2C data is ready to be written out.
 * It also checks if the system is out of retries for this action and exits
 * if true.
 * If data is ready to write, the state machine writes the byte of data and
 * loops back into the state to wait for next I2C event until no more bytes are
 * left to be written.  It then issues a STOP bit on the I2C bus and returns to
 * Idle.
 *
 * @note: this state is WRITE operation specific.
 * @note: some devices on I2C bus, such as EEPROMs, require a post write delay
 * during which the device will not respond to any data. This should be accounted
 * for by the user of this AO since this AO is not device specific.
 *
 * @param  [in,out] me: Pointer to the state machine
 * @param  [in,out] e:  Pointer to the event being processed.
 * @return status_: QState type that specifies where the state
 * machine is going next.
 */
/*${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte} .....*/
static QState I2CBusMgr_WriteI2CByte(I2CBusMgr * const me, QEvt const * const e) {
    QState status_;
    switch (e->sig) {
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte} */
        case Q_ENTRY_SIG: {
            /* Post an event to check for EV5 event */
            QEvt *qEvt = Q_NEW(QEvt, I2C_CHECK_EV_SIG);
            QF_PUBLISH((QEvt *)qEvt, AO_I2CMgr);
            status_ = Q_HANDLED();
            break;
        }
        /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV} */
        case I2C_CHECK_EV_SIG: {
            /* Check if EV6 has happened.  If it has, go on to the next state.  Otherwise,
             * try again until number of retries is out */
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[ReadyToWrite?]} */
            if (I2C_CheckEvent(s_I2C_Bus[me->iBus].i2c_bus, I2C_EVENT_MASTER_BYTE_TRANSMITTED)) {
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[ReadyToWrite?]::[Nomorebytes?]} */
                if (0 == (s_I2C_Bus[me->iBus].nBytesExpected - s_I2C_Bus[me->iBus].nTxIndex)) {
                    I2C_GenerateSTOP(I2C1, ENABLE);                        /* Generate Stop */
                    DBG_printf("Done writing I2C data\n");
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[ReadyToWrite?]::[else]} */
                else {
                    DBG_printf("Writing 0x%02x byte %d to I2C Device\n",
                        s_I2C_Bus[me->iBus].pTxBuffer[ s_I2C_Bus[me->iBus].nTxIndex ],
                        s_I2C_Bus[me->iBus].nTxIndex
                    );

                    /* Send the single byte address to the device */
                    I2C_SendData(
                        s_I2C_Bus[me->iBus].i2c_bus,
                        s_I2C_Bus[me->iBus].pTxBuffer[ s_I2C_Bus[me->iBus].nTxIndex++ ]
                    );
                    status_ = Q_TRAN(&I2CBusMgr_WriteI2CByte);
                }
            }
            /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[else]} */
            else {
                me->nI2CLoopTimeout--;                 /* Decrement counter */
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[else]::[Retriesleft?]} */
                if (me->nI2CLoopTimeout != 0) {
                    status_ = Q_TRAN(&I2CBusMgr_WriteI2CByte);
                }
                /* ${AOs::I2CBusMgr::SM::Active::Busy::WaitFor_I2C_MemW~::WriteI2CByte::I2C_CHECK_EV::[else]::[else]} */
                else {
                    ERR_printf("Timeout waiting for I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED (EV6)\n");
                    status_ = Q_TRAN(&I2CBusMgr_Idle);
                }
            }
            break;
        }
        default: {
            status_ = Q_SUPER(&I2CBusMgr_WaitFor_I2C_MemWrite);
            break;
        }
    }
    return status_;
}


/**
 * @} end addtogroup groupI2C
 */
/******** Copyright (C) 2014 Datacard. All rights reserved *****END OF FILE****/
